Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/refugee_status_and_leave_to_remain/leave_to_remain.html.txt.tmx
Source language: en
Languages: ga

source: Permission to remain in Ireland
ga: Cead chun fanacht in Éirinn

source: Foreign nationals other than EEA and Swiss nationals need permission to live in Ireland
ga: Caithfidh náisiúnaigh coigríche seachas naisiúnaigh ón LEE agus ón Eilbhéis cead a fháil chun cónaí in Éirinn

source: There are different types of permission for non-EEA nationals including those for students and those who are working in Ireland
ga: Tá cineálacha difriúla ceada ann le haghaidh náisiúnach neamh-LEE, cead le haghaidh mac léinn agus cead do dhaoine a oibríonn in Éirinn san áireamh

source: Other non-EEA nationals who have permission to remain in Ireland are those who have been granted refugee status or subsidiary protection
ga: Is daoine ar bronnadh stádas dídeanaithe orthu na náisiúnaigh neamh-LEE eile a bhfuil cead acu fanacht in Éirinn

source: One specific type of permission to live in Ireland is known as permission to remain
ga: Tugtar cead fanachta ar chineál áirithe amháin ceada chun cónaí in Éirinn

source: This is a status that is granted at the discretion of the Minister for Justice and Equality
ga: Is stádas é seo a bhronntar de rogha an Aire Dlí agus Cirt agus Comhionannais

source: Leave to remain may be granted to people who have been refused a refugee or subsidiary protection declaration but who are not returned home for humanitarian or other compelling reasons
ga: Féadfar cead fanachta a bhronnadh ar dhaoine ar diúltaíodh iad a dhearbhú mar dhídeanaithe ach nach bhfuil tar éis filleadh abhaile ar chúis dhaonnúil nó ar chúis an-láidir eile

source: People given permission to remain
ga: Daoine a fhaigheann cead fanachta

source: A person who has been refused a refugee or subsidiary protection declaration may be granted permission to remain in the State
ga: Féadfar cead chun fanacht sa Stát a thabhairt do dhuine ar diúltaíodh é/í a dhearbhú mar dhídeanaí agus nach bhfuil i dteideal cosanta coimhdí

source: A person may also withdraw from the asylum process and seek permission to remain in the State
ga: Is féidir le duine tarraingt siar ón bpróiseas tearmainn agus cead a lorg chun fanacht sa Stát

source: Permission to remain is granted at the discretion of the Minister for Justice and Equality, usually on humanitarian grounds
ga: Tugtar cead fanachta de rogha an Aire Dlí agus Cirt agus Comhionannais, go hiondúil ar chúiseanna daonnúla

source: There are 2 groups of asylum seekers who may be given permission to remain in the State:
ga: Tá 2 ghrúpa iarrtha tearmainn ar féidir cead a bhronnadh orthu chun fanacht sa Stát:

source: People who withdraw from the asylum process
ga: • Iad siúd a tharraingíonn siar ón bpróiseas tearmainn

source: In general, people who withdraw from the asylum process and seek permission to remain are those who marry or enter into a civil partnership with an Irish citizen and those who marry or enter into a civil partnership an EU citizen
ga: • Iad siúd ar dhiúltaigh an Coimisinéir Iarratas do Dhídeanaithe dearbhú mar dhídeanaithe a bhronnadh orthu, ar theip orthu athrú a dhéanamh ar an gcinneadh seo tríd an mBinse Achomhairc Dídeanaithe agus ar diúltaíodh a n-iarratas ar fhochosaint

source: People who were refused a declaration
ga: Is iad seo na daoine a tharraingíonn siar ón bpróiseas tearmainn chun cead fanachta a lorg de ghnáth:

source: If the International Protection Office has made a recommendation that they should be refused a refugee or subsidiary protection declaration, and this recommendation has not been overturned by the International Protection Appeals Tribunal, the Minister may consider whether they should be given permission to remain in the State
ga: • Daoine a phósann nó a dhéanann páirtnéireacht shibhialta le saoránach Éireannach agus • Daoine a phósann nó a dhéanann páirtnéireacht shibhialta le saoránach AE

source: Parents of Irish citizen children
ga: Tuismitheoirí de leanaí ar shaoránaigh Éireannacha iad

source: Under the Irish Born Child Scheme (IBC/05) a number of non-EEA national parents of children born in the State prior to 1 January 2005 were granted permission to remain for an initial period of 2 years
ga: Faoin Scéim um Leanaí a Rugadh in Éirinn (IBC/05) tugadh cead fanachta tosaigh de 2 bhliain, do roinnt tuismitheoirí neamh-LEE le leanaí a rugadh sa Stát roimh an 1 Eanáir 2005

source: Many of them had their permission to remain extended subject to certain conditions in 2007, 2010 and 2013
ga: I 2007, 2010 agus 2013 síníodh an cead fanachta le haghaidh mórán díobh faoi réir coinníollacha áirithe

source: From 1 October 2015, there is a new application procedure to renew their permission to remain – see 'How to apply' below
ga: Ó Deireadh Fómhair 2015, tá nós imeachta nua um athnuachan a gcead fanachta a dhéanamh - féach 'Conas iarratas a dhéanamh' thíos

source: On 8 March 2011 the European Court of Justice (ECJ) ruled in the Zambrano case C 34/09, that an EU member state may not refuse the non-EU parents of a dependent child who is a citizen of, and resident in, an EU member state the right to live and work in that member state
ga: Ar 8 Márta 2011 rialaigh an Chúirt Cheartais Eorpach (CCE) ar an gcás Zambrano C 34/09, nach féidir le haon bhallstát Eorpach diúltiú do thuismitheoirí neamh-AE de leanbh cleithiúnach ar shaoránach é, agus a bhfuil cónaí air, i mballstát Eorpach ceart cónaithe agus oibre sa bhallstát sin

source: Non-EEA parents who meet the Zambrano criteria may be given permission to live and work in Ireland without the requirement for an employment permit or business permission
ga: Má chomhlíonann siad critéir Zambrano, d’fhéadfaí go dtabharfaí cead do na tuismitheoirí neamh-LEE cónaí agus oibriú in Éirinn gan ceanglais cead fostaíochta nó cead gnó

source: From 1 October 2015, there is a new application procedure for non-EEA parents applying for permission to remain based on parentage of an Irish citizen child – see 'How to apply' below
ga: Ó Deireadh Fómhair 2015, tá nós imeachta iarratais nua do thuismitheoirí neamh-LEE a dhéanann iarratais ar chead fanachta bunaithe ar thuismíocht linbh ar shaoránaigh Éireannacha é/í - féach 'Conas iarratas a dhéanamh' thíos

source: Rights of people granted permission to remain
ga: Cearta daoine ar bronnadh cead fanachta orthu

source: Persons granted permission to remain do not have all of the same rights as persons granted refugee or subsidiary protection status
ga: Tá go leor de na cearta céanna ag daoine a fhaigheann cead fanachta agus atá ag daoine a bhaineann stádas dídeanaithe nó cosanta coimhdí amach

source: They must have been resident in Ireland for 5 years before they are eligible to apply for Irish citizenship
ga: Caitfidh siad bheith in a gcónaí in Éirinn ar feadh 5 bliana chun bheith i dteideal iarratas a dhéanamh ar shaoránacht

source: They do not have the right to family reunification but anyone who is entitled to reside and remain in the State may apply to the Minister to permit family members to join them
ga: Níl ceart acu i leith athaontú teaghlaigh ach féadfaidh aon duine atá i dteideal cónaí agus fanacht sa Stát iarratas a chur chuig an Aire chun go gceadódh sé do dhaoine muinteartha teacht isteach sa Stát freisin

source: The Minister for Justice and Equality can grant or refuse permission on a discretionary basis
ga: Féadfaidh an tAire Dlí agus Cirt agus Comhionannais cead a bhronnadh nó a dhiúltiú ar bhonn lánroghnach

source: In addition, foreign national parents granted permission to remain under the Irish Born Child Scheme (IBC/05) are not eligible for maintenance grants or free fees for third-level education
ga: Níl na tuismitheoirí náisiúnaigh coigríche a fhaigheann cead fanachta faoi Scéim Leanaí a Rugadh in Éirinn (IBC/05) cáilithe chun deontais tríu leibhéal nó táillí a fháil

source: For those who withdraw from the asylum process the procedure for seeking permission to remain is as follows:
ga: I gcás iad siúd a tharraingíonn siar ón bpróiseas tearmainn, is é seo a leanas an bealach ina lorgaítear cead fanachta:

source: • If you are the spouse or civil partner of an Irish citizen details of how to apply for permission to remain are on the website of the Irish Naturalisation and Immigration Service (INIS)
ga: • Más céile nó páirtnéir sibhialta le saoránach Éireannach tu tá sonraí maidir le iarratas ar chead fanachta ar fáil ar suíomh na Seirbhíse Eadóirseachta agus Inimirce na hÉireann (SEIÉ)

source: If you are a family member of an EEA or Swiss citizen you apply to INIS EU Treaty Rights section - see 'Where to apply' below
ga: Más ball teaghlaigh le saoránach LEE nó an Eilvéis tú déanann tú iarratas i scríbhinn le SEIÉ Rannóg um Chearta Chonradh AE - féach 'Cá háit a ndéanfaidh mé iarratas' thíos

source: • Your letter of application must be accompanied by the relevant original documentation, such as your marriage or civil partnership certificate
ga: • Caithfidh an doiciméadúchán bunaidh, ar nós do dheimhniú phósta nó pháirtnéireachta shibhialta, a bheith iniata le do litir iarratais

source: • INIS will then consider your application and advise the Minister for Justice and Equality accordingly who will make a decision on your application
ga: • Measfaidh an SEIÉ d'iarratas ansin agus cuirfidh sí comhairle ar an Aire Dlí agus Cirt agus Comhionannais a dhéanfaidh cinneadh i dtaobh d'iarratais

source: • You will be informed in writing of the outcome of your application
ga: • Cuirfear fógra scríofa chugat i dtaobh thoradh d'iarratais

source: If you are applying for permission to remain as the parent of an Irish citizen child, from 1 October 2015, you must apply using the Irish citizen child application form (pdf)
ga: Má dhéanann tú iarratas ar chead fanachta mar thuismitheoir linbh ar shaoránach Éireannach é/í, ó 1 Deireadh Fómhair 2015, caithfidh tú iarratas a dhéanamh tríd an fhoirm iarratais linbh ar shaoránach Éireannach é/í (pdf) a úsáid

source: Guidelines for completing the form are available on the INIS website
ga: Tá treoirlínte maidir leis an fhoirm a chomhlánú ar fáil ar shuíomh SEIÉ

source: The completed form should be sent to INIS Residence Division Unit 4 – see ‘Where to apply’ below
ga: Ba chóir duit an fhoirm comhlánaithe chuig Rannán Cónaithe SEIÉ Aonad 4 a sheoladh – féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos

source: If you are granted permission to remain, you must register with your local immigration office.This is the Garda National Immigration Bureau (GNIB) if you live in Dublin and your Garda District Headquarters if you live outside Dublin
ga: Is d’oifig chlárúcháin inimirce áitiúil é sin Biúró Náisiúnta an Gharda Síochána um Inimirce (BNGSI) má tá cónaí ort i mBaile Átha Cliath agus do Cheanncheathrú Ceantair an Gharda Síochána má tá cónaí ort taobh amuigh de Bhaile Átha Cliath
